; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-7-17)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p1-4 - location
	p1-7 - location
	p2-0 - location
	p2-4 - location
	p2-6 - location
	p3-1 - location
	p4-5 - location
	p5-0 - location
	p5-1 - location
	p5-2 - location
	p6-4 - location
	p6-7 - location
	p7-3 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s7)
	(at driver3 s7)
	(at driver4 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s1)
	(at package2 s2)
	(at package3 s5)
	(at package4 s6)
	(at package5 s6)
	(at package6 s5)
	(at package7 s6)
	(at package8 s3)
	(at package9 s6)
	(at package10 s0)
	(at package11 s0)
	(at package12 s7)
	(at package13 s0)
	(at package14 s5)
	(at package15 s3)
	(at package16 s4)
	(at package17 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s4)
	(link s4 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s6)
	(link s6 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s2)
	(link s2 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s6)
	(link s6 s7)
)
	(:goal (and
	(at driver1 s7)
	(at driver3 s2)
	(at truck2 s4)
	(at truck4 s1)
	(at truck5 s0)
	(at package1 s7)
	(at package2 s7)
	(at package3 s2)
	(at package4 s1)
	(at package5 s5)
	(at package6 s0)
	(at package7 s1)
	(at package8 s2)
	(at package9 s5)
	(at package10 s6)
	(at package11 s0)
	(at package12 s2)
	(at package13 s7)
	(at package14 s6)
	(at package15 s5)
	(at package16 s2)
	(at package17 s0)
	))


)

; plan
1. (board-truck driver1 s0 truck4)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 22
2. (load-truck s2 package2 truck6)
   deleted: (at package2 s2)
   added: (in package2 truck6)
   goals met: 2 of 22
3. (board-truck driver4 s2 truck6)
   deleted: (at driver4 s2) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 2 of 22
4. (drive-truck driver4 s2 s1 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   goals met: 2 of 22
5. (drive-truck driver4 s1 s5 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   goals met: 2 of 22
6. (drive-truck driver4 s5 s6 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s6)
   goals met: 2 of 22
7. (load-truck s6 package9 truck6)
   deleted: (at package9 s6)
   added: (in package9 truck6)
   goals met: 2 of 22
8. (drive-truck driver4 s6 s5 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s5)
   goals met: 2 of 22
9. (unload-truck s5 package9 truck6)
   deleted: (in package9 truck6)
   added: (at package9 s5)
   goals met: 3 of 22
10. (load-truck s5 package6 truck6)
   deleted: (at package6 s5)
   added: (in package6 truck6)
   goals met: 3 of 22
11. (drive-truck driver4 s5 s6 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s6)
   goals met: 3 of 22
12. (load-truck s6 package7 truck6)
   deleted: (at package7 s6)
   added: (in package7 truck6)
   goals met: 3 of 22
13. (load-truck s6 package5 truck6)
   deleted: (at package5 s6)
   added: (in package5 truck6)
   goals met: 3 of 22
14. (drive-truck driver4 s6 s5 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s5)
   goals met: 3 of 22
15. (unload-truck s5 package5 truck6)
   deleted: (in package5 truck6)
   added: (at package5 s5)
   goals met: 4 of 22
16. (load-truck s5 package3 truck6)
   deleted: (at package3 s5)
   added: (in package3 truck6)
   goals met: 4 of 22
17. (drive-truck driver4 s5 s3 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   goals met: 4 of 22
18. (load-truck s3 package8 truck6)
   deleted: (at package8 s3)
   added: (in package8 truck6)
   goals met: 4 of 22
19. (drive-truck driver4 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 4 of 22
20. (unload-truck s2 package8 truck6)
   deleted: (in package8 truck6)
   added: (at package8 s2)
   goals met: 5 of 22
21. (drive-truck driver4 s2 s1 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s1)
   goals met: 5 of 22
22. (unload-truck s1 package7 truck6)
   deleted: (in package7 truck6)
   added: (at package7 s1)
   goals met: 6 of 22
23. (load-truck s1 package1 truck6)
   deleted: (at package1 s1)
   added: (in package1 truck6)
   goals met: 6 of 22
24. (drive-truck driver4 s1 s0 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 6 of 22
25. (drive-truck driver4 s0 s6 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   goals met: 6 of 22
26. (load-truck s6 package4 truck6)
   deleted: (at package4 s6)
   added: (in package4 truck6)
   goals met: 6 of 22
27. (load-truck s0 package13 truck4)
   deleted: (at package13 s0)
   added: (in package13 truck4)
   goals met: 6 of 22
28. (drive-truck driver1 s0 s7 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   goals met: 6 of 22
29. (drive-truck driver4 s6 s0 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s0)
   goals met: 6 of 22
30. (unload-truck s0 package6 truck6)
   deleted: (in package6 truck6)
   added: (at package6 s0)
   goals met: 7 of 22
31. (load-truck s0 package10 truck6)
   deleted: (at package10 s0)
   added: (in package10 truck6)
   goals met: 7 of 22
32. (drive-truck driver4 s0 s2 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   goals met: 7 of 22
33. (drive-truck driver4 s2 s6 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s6)
   goals met: 7 of 22
34. (unload-truck s6 package10 truck6)
   deleted: (in package10 truck6)
   added: (at package10 s6)
   goals met: 8 of 22
35. (drive-truck driver4 s6 s5 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s5)
   goals met: 8 of 22
36. (load-truck s5 package14 truck6)
   deleted: (at package14 s5)
   added: (in package14 truck6)
   goals met: 8 of 22
37. (drive-truck driver4 s5 s6 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s6)
   goals met: 8 of 22
38. (unload-truck s6 package14 truck6)
   deleted: (in package14 truck6)
   added: (at package14 s6)
   goals met: 9 of 22
39. (unload-truck s7 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s7)
   goals met: 10 of 22
40. (load-truck s7 package12 truck4)
   deleted: (at package12 s7)
   added: (in package12 truck4)
   goals met: 10 of 22
41. (walk driver3 s7 p6-7)
   deleted: (at driver3 s7)
   added: (at driver3 p6-7)
   goals met: 10 of 22
42. (walk driver2 s7 p1-7)
   deleted: (at driver2 s7)
   added: (at driver2 p1-7)
   goals met: 10 of 22
43. (walk driver2 p1-7 s1)
   deleted: (at driver2 p1-7)
   added: (at driver2 s1)
   goals met: 10 of 22
44. (board-truck driver2 s1 truck5)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 10 of 22
45. (drive-truck driver2 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 11 of 22
46. (walk driver3 p6-7 s6)
   deleted: (at driver3 p6-7)
   added: (at driver3 s6)
   goals met: 11 of 22
47. (walk driver3 s6 p2-6)
   deleted: (at driver3 s6)
   added: (at driver3 p2-6)
   goals met: 11 of 22
48. (walk driver3 p2-6 s2)
   deleted: (at driver3 p2-6)
   added: (at driver3 s2)
   goals met: 12 of 22
49. (drive-truck driver2 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 11 of 22
50. (drive-truck driver4 s6 s7 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s7)
   goals met: 11 of 22
51. (unload-truck s7 package2 truck6)
   deleted: (in package2 truck6)
   added: (at package2 s7)
   goals met: 12 of 22
52. (unload-truck s7 package1 truck6)
   deleted: (in package1 truck6)
   added: (at package1 s7)
   goals met: 13 of 22
53. (drive-truck driver4 s7 s5 truck6)
   deleted: (at truck6 s7)
   added: (at truck6 s5)
   goals met: 13 of 22
54. (drive-truck driver4 s5 s1 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   goals met: 13 of 22
55. (unload-truck s1 package4 truck6)
   deleted: (in package4 truck6)
   added: (at package4 s1)
   goals met: 14 of 22
56. (drive-truck driver4 s1 s2 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   goals met: 14 of 22
57. (drive-truck driver4 s2 s3 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   goals met: 14 of 22
58. (load-truck s3 package17 truck6)
   deleted: (at package17 s3)
   added: (in package17 truck6)
   goals met: 14 of 22
59. (drive-truck driver4 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 14 of 22
60. (unload-truck s2 package3 truck6)
   deleted: (in package3 truck6)
   added: (at package3 s2)
   goals met: 15 of 22
61. (drive-truck driver4 s2 s0 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   goals met: 15 of 22
62. (unload-truck s0 package17 truck6)
   deleted: (in package17 truck6)
   added: (at package17 s0)
   goals met: 16 of 22
63. (load-truck s4 package16 truck5)
   deleted: (at package16 s4)
   added: (in package16 truck5)
   goals met: 16 of 22
64. (drive-truck driver2 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 16 of 22
65. (unload-truck s2 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s2)
   goals met: 17 of 22
66. (drive-truck driver2 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 18 of 22
67. (drive-truck driver4 s0 s6 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   goals met: 18 of 22
68. (drive-truck driver4 s6 s3 truck6)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   goals met: 18 of 22
69. (load-truck s3 package15 truck6)
   deleted: (at package15 s3)
   added: (in package15 truck6)
   goals met: 18 of 22
70. (drive-truck driver4 s3 s5 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   goals met: 18 of 22
71. (unload-truck s5 package15 truck6)
   deleted: (in package15 truck6)
   added: (at package15 s5)
   goals met: 19 of 22
72. (drive-truck driver1 s7 s5 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   goals met: 19 of 22
73. (drive-truck driver1 s5 s1 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   goals met: 20 of 22
74. (drive-truck driver1 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 19 of 22
75. (unload-truck s2 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s2)
   goals met: 20 of 22
76. (drive-truck driver1 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 21 of 22
77. (disembark-truck driver1 s1 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 21 of 22
78. (walk driver1 s1 p1-7)
   deleted: (at driver1 s1)
   added: (at driver1 p1-7)
   goals met: 21 of 22
79. (walk driver1 p1-7 s7)
   deleted: (at driver1 p1-7)
   added: (at driver1 s7)
   goals met: 22 of 22
